import structs as s
# import visual

def main():
    n = int(input("Выберете раскладку:\n1) ЙЦУКЕН\n2) Фонетическая\n3) Диктор\n4) Скоропись\n5) ANT\n6) Зубачев\n7) Вызов\n"))
    match n:
        case 1:
            l = s.Layout()
        case 2:
            l = s.Layout('ю1234567890-ч', 'явертыуиопшщэ', 'асдфгхйкл;\'', 'зьцжбнм,./')
        case 3:
            l = s.Layout('ё1234567890*=', 'цья,.звкдчшщ@', 'уиеоалнтсрй', 'фэхыюбмпгж')
        case 4:
            l = s.Layout('*.ёъ?!@-\'()-"', 'цья,.звкдчшщ"', 'уиеоалнтсрй', 'фэхыюбмпгж')
        case 5:
            l = s.Layout('\\!?\'"=+-*/%()', 'гпрдмыияухцжч', 'внстльоеакз', 'щйшб,.юэёф')
        case 6:
            l = s.Layout('ё1234567890-=', 'фыая,ймрпхцщ\\', 'гиеоултмнзж', 'шью.эбдвкч')
        case 7:
            l = s.Layout('@ё[{}(=*)+]!щ', 'быоуьёлдягжцъ', 'чиеа,.нтсвз', 'шхйк-/рмфп')
    n = int(input("Что хотим сделать?\n1) Прогнать через файл\n2) Штрафы построчно\n3) Сравнение раскладок\n"))
    match n:
        case 1:
            path = input("Введите путь к файлу: ")
            l.readf(path)
        case 2:
            path = input("Введите путь к файлу: ")
            l.lexeme(path)
        case 3:
            pass
    #l1.lexeme("1grams-3.txt")
    #l1.readf("voina-i-mir.txt")

    
if __name__ == "__main__":
    main()
